// --- ОБЩИЕ НАСТРОЙКИ ТРЕНАЖЁРА ---
const trainerSettings = {
    title: "Счёт",
    subtitle: "Примеры со скобками",
    totalTime: 900 // 15 минут
};

// --- ВЫБОРКА ЗАДАЧ ---
const problemSelectors = [
    {
        count: 1,
        filter: {
            tags: '"4_класс" & "счёт" & "скобки" & "1" & not ("sparse_nums" | "деление_на_многозначное" | "умножение_на_многозначное")'
        }
    },
    {
        count: 1,
        filter: {
            tags: '"4_класс" & "счёт" & "скобки" & "2" & not ("sparse_nums" | "деление_на_многозначное" | "умножение_на_многозначное")'
        }
    },
    {
        count: 1,
        filter: {
            tags: '"4_класс" & "счёт" & "скобки" & "3" & not ("sparse_nums" | "деление_на_многозначное" | "умножение_на_многозначное")'
        }
    },
];