// --- ОБЩИЕ НАСТРОЙКИ ТРЕНАЖЁРА ---
const trainerSettings = {
    title: "Счёт, уравнения, именованные величины",
    subtitle: "итоговая работа",
    totalTime: 900 // 15 минут
};

// --- ВЫБОРКА ЗАДАЧ ---
const problemSelectors = [
    {
        count: 1,
        filter: {
            tags: {
                include: ["4_класс", "счёт", "без_скобок"],
                any: ["деление_на_однозначное", "умножение_на_однозначное"],           
                exclude: ["деление_на_многозначное", "умножение_на_многозначное", "sparse_nums"]
            }
        }
    },

    {
        count: 1,
        filter: {
            tags: {
                include: ["4_класс", "уравнение", "скобки"],
                any: ["деление_на_однозначное", "умножение_на_однозначное"],           
                exclude: ["деление_на_многозначное", "умножение_на_многозначное"]
            }
        }
    },

    {
        count: 1,
        filter: {
            tags: {
                include: ["4_класс", "перевод_единиц"],
                any: ["единицы_массы", "единицы_длины"], 
                exclude: ["текстовая_задача"]
            }
        }
    },

    {
        count: 1,
        filter: {
            tags: {
                include: ["4_класс", "перевод_единиц", "текстовая_задача"],
                any: ["единицы_массы", "единицы_длины"] 
            }
        }
    },

    {
        count: 1,
        filter: {
            tags: {
                include: ["время_на_часах", "4_класс", "текстовая_задача"]
            }
        }
    }
];