// --- ОБЩИЕ НАСТРОЙКИ ТРЕНАЖЁРА ---
const trainerSettings = {
    title: "Тест",
    subtitle: "задачи на массу, длину, время",
    totalTime: 900 // 15 минут
};

// --- ВЫБОРКА ЗАДАЧ ---
const problemSelectors = [
    {
        count: 1,
        filter: {
            tags: {
                include: ["4_класс", "перевод_единиц", "единицы_массы"],           
                exclude: ["деление_именованных_величин", "текстовая_задача"]
            }
        }
    },

    {
        count: 1,
        filter: {
            tags: {
                include: ["4_класс", "текстовая_задача", "перевод_единиц", "единицы_длины"]
            }
        }
    },

    {
        count: 1,
        filter: {
            tags: {
                include: ["время_на_часах", "4_класс", "текстовая_задача"]
            }
        }
    }
];